OfficeActivity
| where RecordType in ("ExchangeAdmin") and Operation in ("Set-AuthenticationPolicy")
| extend Params = todynamic(Parameters)
| mv-expand Params
| extend AuthMethod = parse_json(Params).Name
| extend Value = parse_json(Params).Value
| extend SourceUser = split(UserId, "@")[0]
| where AuthMethod contains "AllowBasicAuth" and Value == "True"
